In [1]:
import pandas as pd
df=pd.read_csv('sample_data.csv')
df.head()

   ID     Name   Age  Gender   Income         City
0   1    Alice  25.0  Female  50000.0     New York
1   2      Bob  30.0    Male  60000.0  Los Angeles
2   3  Charlie  35.0    Male      NaN      Chicago
3   4    David   NaN    Male  80000.0      Houston
4   5      Eve  40.0  Female  75000.0      Phoenix

In [3]:
df.isnull().sum()

ID        0
Name      0
Age       1
Gender    0
Income    1
City      0
dtype: int64

In [5]:
df1=df.dropna(axis=0)

In [7]:
df1

   ID   Name   Age  Gender   Income         City
0   1  Alice  25.0  Female  50000.0     New York
1   2    Bob  30.0    Male  60000.0  Los Angeles
4   5    Eve  40.0  Female  75000.0      Phoenix

In [9]:
df1.isnull().sum()

ID        0
Name      0
Age       0
Gender    0
Income    0
City      0
dtype: int64

In [13]:
from sklearn.preprocessing import  StandardScaler
scalar= StandardScaler()
numerical_column=["Age","Income"]
df1[numerical_column]=scalar.fit_transform(df1[numerical_column])
df1.head()

C:\Users\maluk\AppData\Local\Temp\ipykernel_23652\3883418276.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1[numerical_column]=scalar.fit_transform(df1[numerical_column])

   ID   Name       Age  Gender    Income         City
0   1  Alice -1.069045  Female -1.135550     New York
1   2    Bob -0.267261    Male -0.162221  Los Angeles
4   5    Eve  1.336306  Female  1.297771      Phoenix

In [17]:
from sklearn.preprocessing import MinMaxScaler
scalar=MinMaxScaler()
numerical_column=["Age","Income"]
df1[numerical_column]=scalar.fit_transform(df1[numerical_column])
df1.head()

C:\Users\maluk\AppData\Local\Temp\ipykernel_23652\3024514885.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1[numerical_column]=scalar.fit_transform(df1[numerical_column])

   ID   Name       Age  Gender  Income         City
0   1  Alice  0.000000  Female     0.0     New York
1   2    Bob  0.333333    Male     0.4  Los Angeles
4   5    Eve  1.000000  Female     1.0      Phoenix